## STEP 1: Connect to local DB where pagila data is located

In [3]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [ ]:
DB_ENDPOINT = '127.0.0.1'
DB = 'pagila'
DB_USER = 'postgres'
DB_PASSWORD = 'password'
DB_PORT = '5432'


# postgresql://username:password@host:port/database
# postgresql://postgres:postgres@db:5432/pagila

conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)


print(conn_string)
#postgresql://postgres:postgres#127.0.0.1:5432/pagila

In [3]:
%sql $conn_string

'Connected: postgres@pagila'

## STEP 2: Explore the pagila 3NF Schema

## STEP 2.1: How much ? data size we have

In [4]:
nStores = %sql select count(*) from store;
nFilms = %sql select count(*) from film;
nCustomers = %sql select count(*) from customer;
nRentals = %sql select count(*) from rental;
nPayment = %sql select count(*) from payment;
nStaff = %sql select count(*) from staff;
nCity = %sql select count(*) from city;
nCountry = %sql select count(*) from country;

print('\n')
print("nFilms\t\t=", nFilms[0][0])               # 1000
print("nCustomers\t=", nCustomers[0][0])         # 599
print("nRentals\t=", nRentals[0][0])             # 16044
print("nPayment\t=", nPayment[0][0])             # 16049
print("nStaff\t\t=", nStaff[0][0])               # 2
print("nStores\t\t=", nStores[0][0])             # 2
print("nCities\t\t=", nCity[0][0])               # 600
print("nCountry\t=", nCountry[0][0])             # 109

 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.


nFilms		= 1000
nCustomers	= 599
nRentals	= 16044
nPayment	= 14596
nStaff		= 2
nStores		= 2
nCities		= 600
nCountry	= 109

## 2.2 When? What time period are we talking about?

In [5]:
%%sql 
select min(payment_date) as start, max(payment_date) as end from payment;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.

[(datetime.datetime(2007, 2, 14, 21, 21, 59, 996577), datetime.datetime(2007, 5, 14, 13, 44, 29, 996577))]

## 2.3 Where? Where do events in this database occur?
TODO: Write a query that displays the number of addresses by district in the address table. Limit the table to the top 10 districts. Your results should match the table below.

In [6]:
nAdd = %sql select count(*) from address;
print("\n nAdd \t\t=", nAdd[0][0], "\n")


%sql SELECT * FROM address limit 10 ;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.

 nAdd 		= 603

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[(1, '47 MySakila Drive', None, 'Alberta', 300, '', '', datetime.datetime(2006, 2, 15, 9, 45, 30)),
 (2, '28 MySQL Boulevard', None, 'QLD', 576, '', '', datetime.datetime(2006, 2, 15, 9, 45, 30)),
 (3, '23 Workhaven Lane', None, 'Alberta', 300, '', '14033335568', datetime.datetime(2006, 2, 15, 9, 45, 30)),
 (4, '1411 Lillydale Drive', None, 'QLD', 576, '', '6172235589', datetime.datetime(2006, 2, 15, 9, 45, 30)),
 (5, '1913 Hanoi Way', '', 'Nagasaki', 463, '35200', '28303384290', datetime.datetime(2006, 2, 15, 9, 45, 30)),
 (6, '1121 Loja Avenue', '', 'California', 449, '17886', '838635286649', datetime.datetime(2006, 2, 15, 9, 45, 30)),
 (7, '692 Joliet Street', '', 'Attika', 38, '83579', '448477190408', datetime.datetime(2006, 2, 15, 9, 45, 30)),
 (8, '1566 Inegl Manor', '', 'Mandalay', 349, '53561', '705814003527', datetime.datetime(2006, 2, 15, 9, 45, 30)),
 (9, '53 Idfu Parkway', '', 'Nantou', 361, '42399', '10655648674', datetime.datetime(2006, 2, 15, 9, 45, 30)),
 (10, '1795 Santiago de Compostela Way', '', 'Texas', 295, '18743', '860452626434', datetime.datetime(2006, 2, 15, 9, 45, 30))]

In [7]:
%%sql 
SELECT district, SUM(city_id) as n FROM address
GROUP BY district
ORDER BY n desc
limit 10 ;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[('Shandong', 3237),
 ('England', 2974),
 ('So Paulo', 2952),
 ('West Bengali', 2623),
 ('Buenos Aires', 2572),
 ('Uttar Pradesh', 2462),
 ('California', 2444),
 ('Southern Tagalog', 1931),
 ('Tamil Nadu', 1807),
 ('Hubei', 1790)]

## STEP 3: Perform some simple data analysis

## 3.1 Insight 1: Top Grossing Movies
* Payments amounts are in table payment
* Movies are in table film
* They are not directly linked, payment refers to a rental, rental 
refers to inventory, and inventory refers to a film
* Payents -> rental -> inventory -> film

## 3.1.1 Films

In [8]:
%%sql 
select film_id, title, release_year, rental_rate, rating from film limit 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(133, 'Chamber Italian', 2006, Decimal('4.99'), 'NC-17'),
 (384, 'Grosse Wonderful', 2006, Decimal('4.99'), 'R'),
 (8, 'Airport Pollock', 2006, Decimal('4.99'), 'R'),
 (98, 'Bright Encounters', 2006, Decimal('4.99'), 'PG-13'),
 (1, 'Academy Dinosaur', 2006, Decimal('0.99'), 'PG')]

## 3.1.2 Payments

In [9]:
%%sql 
select * from payment limit 5 ;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(17503, 341, 2, 1520, Decimal('7.99'), datetime.datetime(2007, 2, 15, 22, 25, 46, 996577)),
 (17504, 341, 1, 1778, Decimal('1.99'), datetime.datetime(2007, 2, 16, 17, 23, 14, 996577)),
 (17505, 341, 1, 1849, Decimal('7.99'), datetime.datetime(2007, 2, 16, 22, 41, 45, 996577)),
 (17506, 341, 2, 2829, Decimal('2.99'), datetime.datetime(2007, 2, 19, 19, 39, 56, 996577)),
 (17507, 341, 2, 3130, Decimal('7.99'), datetime.datetime(2007, 2, 20, 17, 31, 48, 996577))]

## 3.1.3 Inventory

In [10]:
%%sql 
select * from inventory limit 5 ;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17)),
 (2, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17)),
 (3, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17)),
 (4, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17)),
 (5, 1, 2, datetime.datetime(2006, 2, 15, 10, 9, 17))]

## 3.1.3b Rental

In [11]:
%%sql 
select * from rental limit 5 ;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(2, datetime.datetime(2005, 5, 24, 22, 54, 33), 1525, 459, datetime.datetime(2005, 5, 28, 19, 40, 33), 1, datetime.datetime(2006, 2, 16, 2, 30, 53)),
 (3, datetime.datetime(2005, 5, 24, 23, 3, 39), 1711, 408, datetime.datetime(2005, 6, 1, 22, 12, 39), 1, datetime.datetime(2006, 2, 16, 2, 30, 53)),
 (4, datetime.datetime(2005, 5, 24, 23, 4, 41), 2452, 333, datetime.datetime(2005, 6, 3, 1, 43, 41), 2, datetime.datetime(2006, 2, 16, 2, 30, 53)),
 (5, datetime.datetime(2005, 5, 24, 23, 5, 21), 2079, 222, datetime.datetime(2005, 6, 2, 4, 33, 21), 1, datetime.datetime(2006, 2, 16, 2, 30, 53)),
 (6, datetime.datetime(2005, 5, 24, 23, 8, 7), 2792, 549, datetime.datetime(2005, 5, 27, 1, 32, 7), 1, datetime.datetime(2006, 2, 16, 2, 30, 53))]

## 3.1.4 Get the movie of every payment Using JOIN

In [12]:
%%sql 
SELECT f.title, p.amount, p.payment_date, p.customer_id
FROM payment p 
JOIN rental r ON (p.rental_id = r.rental_id)
JOIN inventory i ON (r.inventory_id = i.inventory_id)
JOIN film f ON (i.film_id = f.film_id)
limit 5 ;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[('Academy Dinosaur', Decimal('0.99'), datetime.datetime(2007, 4, 8, 17, 31, 41, 996577), 431),
 ('Academy Dinosaur', Decimal('3.99'), datetime.datetime(2007, 3, 2, 18, 41, 36, 996577), 518),
 ('Academy Dinosaur', Decimal('3.99'), datetime.datetime(2007, 3, 21, 19, 56, 9, 996577), 279),
 ('Academy Dinosaur', Decimal('0.99'), datetime.datetime(2007, 2, 17, 18, 52, 26, 996577), 170),
 ('Academy Dinosaur', Decimal('0.99'), datetime.datetime(2007, 4, 7, 9, 9, 57, 996577), 161)]

## 3.1.5 Get sum movie rental revenue

In [13]:
%%sql 
SELECT f.title, sum(p.amount) as revenue
FROM payment p 
JOIN rental r ON (p.rental_id = r.rental_id)
JOIN inventory i ON (r.inventory_id = i.inventory_id)
JOIN film f ON (i.film_id = f.film_id)
GROUP BY title
ORDER BY revenue desc
limit 10 ;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[('Telegraph Voyage', Decimal('215.75')),
 ('Zorro Ark', Decimal('199.72')),
 ('Wife Turn', Decimal('198.73')),
 ('Innocent Usual', Decimal('191.74')),
 ('Hustler Party', Decimal('190.78')),
 ('Saturday Lambs', Decimal('190.74')),
 ('Titans Jerk', Decimal('186.73')),
 ('Harry Idaho', Decimal('177.73')),
 ('Torque Bound', Decimal('169.76')),
 ('Dogma Family', Decimal('168.72'))]

## 3.2 Insight 2: Top grossing cities
* Payments amounts are in table payment
* Cities are in table cities
* payment -> customer -> address -> city

## 3.2.1 Get the city of each payment

In [14]:
%%sql 
SELECT p.customer_id, p.rental_id, p.amount, ci.city as revenue
FROM payment p 
JOIN customer c ON (p.customer_id = c.customer_id)
JOIN address a ON (c.address_id = a.address_id)
JOIN city ci ON (a.city_id = ci.city_id)
ORDER BY p.payment_date
limit 10 ;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[(416, 1158, Decimal('2.99'), 'Dadu'),
 (516, 1159, Decimal('4.99'), 'Battambang'),
 (239, 1160, Decimal('4.99'), 'Ciomas'),
 (592, 1163, Decimal('6.99'), 'Szkesfehrvr'),
 (49, 1164, Decimal('0.99'), 'Jedda'),
 (264, 1165, Decimal('3.99'), 'Higashiosaka'),
 (46, 1166, Decimal('4.99'), 'Moscow'),
 (481, 1168, Decimal('2.99'), 'Mwanza'),
 (139, 1169, Decimal('2.99'), 'Touliu'),
 (595, 1170, Decimal('2.99'), 'Jinzhou')]

## Top grossing cities

In [15]:
%%sql 
SELECT ci.city, sum(p.amount) as revenue
FROM payment p 
JOIN customer c ON (p.customer_id = c.customer_id)
JOIN address a ON (c.address_id = a.address_id)
JOIN city ci ON (a.city_id = ci.city_id)
group BY ci.city
order by revenue desc
limit 10 ;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[('Saint-Denis', Decimal('211.55')),
 ('Cape Coral', Decimal('208.58')),
 ('Santa Brbara dOeste', Decimal('194.61')),
 ('Apeldoorn', Decimal('191.62')),
 ('Molodetno', Decimal('189.60')),
 ('Qomsheh', Decimal('183.63')),
 ('London', Decimal('174.54')),
 ('Memphis', Decimal('167.67')),
 ('Richmond Hill', Decimal('167.62')),
 ('Tanza', Decimal('166.61'))]

## 3.3 Insight 3: Revenue of a movie by customer city and by month

## 3.3.1 Total revenue by month

In [16]:
%%sql 
SELECT sum(p.amount) as revenue, EXTRACT (month FROM p.payment_date) as month
FROM payment p 
group BY month
order by revenue desc
limit 10 ;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
4 rows affected.

[(Decimal('28559.46'), 4.0),
 (Decimal('23886.56'), 3.0),
 (Decimal('8351.84'), 2.0),
 (Decimal('514.18'), 5.0)]

## 3.3.2 Each movie by customer city and by month (data cube)

In [17]:
%%sql 
SELECT f.title, p.amount, p.customer_id, ci.city, p.payment_date, EXTRACT(month FROM p.payment_date) as month
FROM payment p 
JOIN rental r ON (p.rental_id = r.rental_id)
JOIN inventory i ON (r.inventory_id = i.inventory_id)
JOIN film f ON (i.film_id = f.film_id)
JOIN customer c ON (p.customer_id = c.customer_id)
JOIN address a ON (c.address_id = a.address_id)
JOIN city ci ON (a.city_id = ci.city_id)
order by p.payment_date
limit 10 ;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[('Giant Troopers', Decimal('2.99'), 416, 'Dadu', datetime.datetime(2007, 2, 14, 21, 21, 59, 996577), 2.0),
 ('Wash Heavenly', Decimal('4.99'), 516, 'Battambang', datetime.datetime(2007, 2, 14, 21, 23, 39, 996577), 2.0),
 ('Name Detective', Decimal('4.99'), 239, 'Ciomas', datetime.datetime(2007, 2, 14, 21, 29, 0, 996577), 2.0),
 ('Truman Crazy', Decimal('6.99'), 592, 'Szkesfehrvr', datetime.datetime(2007, 2, 14, 21, 41, 12, 996577), 2.0),
 ('Sleuth Orient', Decimal('0.99'), 49, 'Jedda', datetime.datetime(2007, 2, 14, 21, 44, 52, 996577), 2.0),
 ('None Spiking', Decimal('3.99'), 264, 'Higashiosaka', datetime.datetime(2007, 2, 14, 21, 44, 53, 996577), 2.0),
 ('Maiden Home', Decimal('4.99'), 46, 'Moscow', datetime.datetime(2007, 2, 14, 21, 45, 29, 996577), 2.0),
 ('Wagon Jaws', Decimal('2.99'), 481, 'Mwanza', datetime.datetime(2007, 2, 14, 22, 3, 35, 996577), 2.0),
 ('Divine Resurrection', Decimal('2.99'), 139, 'Touliu', datetime.datetime(2007, 2, 14, 22, 11, 22, 996577), 2.0),
 ('Lost Bird', Decimal('2.99'), 595, 'Jinzhou', datetime.datetime(2007, 2, 14, 22, 16, 1, 996577), 2.0)]

In [18]:
%%sql 
SELECT f.title, ci.city, EXTRACT(month FROM p.payment_date) as month, sum(p.amount) as revenue
FROM payment p 
JOIN rental r ON (p.rental_id = r.rental_id)
JOIN inventory i ON (r.inventory_id = i.inventory_id)
JOIN film f ON (i.film_id = f.film_id)
JOIN customer c ON (p.customer_id = c.customer_id)
JOIN address a ON (c.address_id = a.address_id)
JOIN city ci ON (a.city_id = ci.city_id)
group by (f.title, ci.city, month)
order by month, revenue desc
limit 10 ;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[('Innocent Usual', 'Valparai', 2.0, Decimal('13.98')),
 ('Virtual Spoilers', 'Syrakusa', 2.0, Decimal('10.99')),
 ('Autumn Crow', 'Stockport', 2.0, Decimal('10.99')),
 ('Telegraph Voyage', 'Pangkal Pinang', 2.0, Decimal('10.99')),
 ('Tycoon Gathering', 'So Bernardo do Campo', 2.0, Decimal('10.99')),
 ('Mine Titans', 'Plock', 2.0, Decimal('10.99')),
 ('Satisfaction Confidential', 'Suihua', 2.0, Decimal('10.99')),
 ('Stranger Strangers', 'Czestochowa', 2.0, Decimal('10.99')),
 ('Saturday Lambs', 'Wroclaw', 2.0, Decimal('10.99')),
 ('Doors President', 'Zhoushan', 2.0, Decimal('10.99'))]